content/blog.org
#+hugo_base_dir: ../
#+hugo_section: pages



** Videos
:PROPERTIES:
:EXPORT_FILE_NAME: videos
:EXPORT_HUGO_PUBLISHDATE: 2022-03-27
:END:
*The following videos are Livestreams I recorded for the South Texas Linux User Group. I edited and produced all the Livestreams. If you get any use out of any of them, please consider helping me out on my journey!*

**** Thank You
***** You can Buy Me A Coffee
[[https://www.buymeacoffee.com/eduardorobles][https://cdn.buymeacoffee.com/buttons/v2/default-yellow.png]]

***** Tip with some Sats
[[https://getalby.com/p/tacosandlinux][Tip Some Sats ⚡]]


*** Getting Started with Gitlab - Livestream 6-16-18
Video: https://archive.org/details/stxlug_6-16-18
#+BEGIN_EXPORT html
<iframe src="https://archive.org/embed/stxlug_6-16-18" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>
#+END_EXPORT

*** Beaker Browser - Livestream 7-21-18
Video: https://archive.org/details/stxlug_7-21-18
#+BEGIN_EXPORT html
<iframe src="https://archive.org/embed/stxlug_7-21-18" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>
#+END_EXPORT

*** Launching a Decentralized Website- Livestream 8-18-18
Video: https://archive.org/details/stxlug_8-18-18
#+BEGIN_EXPORT html
<iframe src="https://archive.org/embed/stxlug_8-18-18" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>
#+END_EXPORT

*** Installing Arch Linux - Livestream 9-15-18
Video: https://archive.org/details/stxlug_9-15-18
#+BEGIN_EXPORT html
<iframe src="https://archive.org/embed/stxlug_9-15-18" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>
#+END_EXPORT

*** Ubuntu Server How To -  Livestream 10-20-18
Video: https://archive.org/details/stxlug_10-20-18
#+BEGIN_EXPORT html
<iframe src="https://archive.org/embed/stxlug_10-20-18" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>
#+END_EXPORT

*** Samba Installation Guide - Livestream 12-15-18
Video: https://archive.org/details/stxlug_12-15-18
Meeting Notes: https://gitlab.com/stxlug/STXLUG-Meetups/-/tree/master/meetups/12-15-18_Meetup
#+BEGIN_EXPORT html
<iframe src="https://archive.org/embed/stxlug_12-15-18" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>
#+END_EXPORT

*** Bash Scripts and Cron Jobs
Video: https://archive.org/details/stxlug-1-25-20
Meeting Notes: https://gitlab.com/stxlug/STXLUG-Meetups/-/blob/master/meetups/1-25-20_Meetup/notes_1-25-20.org
#+BEGIN_EXPORT html
<iframe src="https://archive.org/embed/stxlug-1-25-20" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>
#+END_EXPORT

*** RazDC a Linux Active Directory Replacement - Livestream 1-19-19
Video: https://archive.org/details/stxlug_1-19-19
Meeting Notes: https://gitlab.com/stxlug/STXLUG-Meetups/-/blob/master/meetups/1-19-19_Meetup/notes_1-19-19.org
#+BEGIN_EXPORT html
<iframe src="https://archive.org/embed/stxlug_1-19-19" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>
#+END_EXPORT

*** Block Ads On Your Network - Livestream 2-16-19
Video: https://archive.org/details/stxlug_2-16-19
Meeting Notes: https://gitlab.com/stxlug/STXLUG-Meetups/-/blob/master/meetups/2-16-19_Meetup/notes_2-16-19.org
#+BEGIN_EXPORT html
<iframe src="https://archive.org/embed/stxlug_2-16-19" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>
#+END_EXPORT

*** Introduction to Encryption - Livestream 3-16-19
Video: https://archive.org/details/stxlug_3-16-19
Meeting Notes: https://gitlab.com/stxlug/STXLUG-Meetups/-/blob/master/meetups/3-16-19_Meetup/notes_3-16-19.org
#+BEGIN_EXPORT html
<iframe src="https://archive.org/embed/stxlug_3-16-19" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>
#+END_EXPORT

*** Encrypt Data and Communications - Livestream 4-20-19
Video: https://archive.org/details/stxlug_4-20-19
Meeting Notes: https://gitlab.com/stxlug/STXLUG-Meetups/-/blob/master/meetups/4-20-19_Meetup/notes_4-20-19.org
#+BEGIN_EXPORT html
<iframe src="https://archive.org/embed/stxlug_4-20-19" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>
#+END_EXPORT

*** Build a Virtualization Server - Livestream 5-18-19
Video: https://archive.org/details/stxlug_5-18-19
Meeting Notes: https://gitlab.com/stxlug/STXLUG-Meetups/-/blob/master/meetups/5-18-19_Meetup/notes_5-18-19.org
#+BEGIN_EXPORT html
<iframe src="https://archive.org/embed/stxlug_5-18-19" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>
#+END_EXPORT

*** Kali Linux Introduction - Livestream 7-20-19
Video: https://archive.org/details/kalilinux_202203
Meeting Notes: https://gitlab.com/stxlug/STXLUG-Meetups/-/blob/master/meetups/7-20-19_Meetup/notes_7-20-19.org
#+BEGIN_EXPORT html
<iframe src="https://archive.org/embed/kalilinux_202203" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>
#+END_EXPORT

*** Build a VPN Server - Livestream 8-17-19
Video: https://archive.org/details/stxlug_08-17-19
Meeting Notes: https://www.stxlug.com/meetup-8-17-19/
#+BEGIN_EXPORT html
<iframe src="https://archive.org/embed/stxlug_08-17-19" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>
#+END_EXPORT

*** Online Security with Tails and Tor Browser - Livestream 10-19-19
Video: https://archive.org/details/stxlug_10-19-19
Meeting Notes: https://www.stxlug.com/meetup-10-19-19/
#+BEGIN_EXPORT html
<iframe src="https://archive.org/embed/stxlug_10-19-19" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>
#+END_EXPORT

*** CentOS Server How To - Livestream 11-24-19
Video: https://archive.org/details/stxlug_11-24-19
Meeting Notes:
#+BEGIN_EXPORT html
<iframe src="https://archive.org/embed/stxlug_11-24-19" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>
#+END_EXPORT

*** Kali Linux vs. ParrotOS - Livestream 12-21-19
Video: https://archive.org/details/stxlug_12-21-19
Meeting Notes: https://gitlab.com/stxlug/STXLUG-Meetups/-/blob/master/meetups/12-21-19_Meetup/notes_12-21-19.org
#+BEGIN_EXPORT html
<iframe src="https://archive.org/embed/stxlug_12-21-19" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>
#+END_EXPORT

