content/pages/videos.md
+++
title = "Videos"
publishDate = 2022-03-27
draft = false
+++

**The following videos are Livestreams I recorded for the South Texas Linux User Group. I edited and produced all the Livestreams. If you get any use out of any of them, please help out and [Buy Me A Coffee](https://www.buymeacoffee.com/eduardorobles).**


## Getting Started with Gitlab - Livestream 6-16-18 {#getting-started-with-gitlab-livestream-6-16-18}

Video: <https://archive.org/details/stxlug%5F6-16-18>

<iframe src="https://archive.org/embed/stxlug_6-16-18" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>


## Beaker Browser - Livestream 7-21-18 {#beaker-browser-livestream-7-21-18}

Video: <https://archive.org/details/stxlug%5F7-21-18>

<iframe src="https://archive.org/embed/stxlug_7-21-18" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>


## Launching a Decentralized Website- Livestream 8-18-18 {#launching-a-decentralized-website-livestream-8-18-18}

Video: <https://archive.org/details/stxlug%5F8-18-18>

<iframe src="https://archive.org/embed/stxlug_8-18-18" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>


## Installing Arch Linux - Livestream 9-15-18 {#installing-arch-linux-livestream-9-15-18}

Video: <https://archive.org/details/stxlug%5F9-15-18>

<iframe src="https://archive.org/embed/stxlug_9-15-18" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>


## Ubuntu Server How To -  Livestream 10-20-18 {#ubuntu-server-how-to-livestream-10-20-18}

Video: <https://archive.org/details/stxlug%5F10-20-18>

<iframe src="https://archive.org/embed/stxlug_10-20-18" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>


## Samba Installation Guide - Livestream 12-15-18 {#samba-installation-guide-livestream-12-15-18}

Video: <https://archive.org/details/stxlug%5F12-15-18>
Meeting Notes: <https://gitlab.com/stxlug/STXLUG-Meetups/-/tree/master/meetups/12-15-18%5FMeetup>

<iframe src="https://archive.org/embed/stxlug_12-15-18" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>


## Bash Scripts and Cron Jobs {#bash-scripts-and-cron-jobs}

Video: <https://archive.org/details/stxlug-1-25-20>
Meeting Notes: <https://gitlab.com/stxlug/STXLUG-Meetups/-/blob/master/meetups/1-25-20%5FMeetup/notes%5F1-25-20.org>

<iframe src="https://archive.org/embed/stxlug-1-25-20" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>


## RazDC a Linux Active Directory Replacement - Livestream 1-19-19 {#razdc-a-linux-active-directory-replacement-livestream-1-19-19}

Video: <https://archive.org/details/stxlug%5F1-19-19>
Meeting Notes: <https://gitlab.com/stxlug/STXLUG-Meetups/-/blob/master/meetups/1-19-19%5FMeetup/notes%5F1-19-19.org>

<iframe src="https://archive.org/embed/stxlug_1-19-19" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>


## Block Ads On Your Network - Livestream 2-16-19 {#block-ads-on-your-network-livestream-2-16-19}

Video: <https://archive.org/details/stxlug%5F2-16-19>
Meeting Notes: <https://gitlab.com/stxlug/STXLUG-Meetups/-/blob/master/meetups/2-16-19%5FMeetup/notes%5F2-16-19.org>

<iframe src="https://archive.org/embed/stxlug_2-16-19" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>


## Introduction to Encryption - Livestream 3-16-19 {#introduction-to-encryption-livestream-3-16-19}

Video: <https://archive.org/details/stxlug%5F3-16-19>
Meeting Notes: <https://gitlab.com/stxlug/STXLUG-Meetups/-/blob/master/meetups/3-16-19%5FMeetup/notes%5F3-16-19.org>

<iframe src="https://archive.org/embed/stxlug_3-16-19" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>


## Encrypt Data and Communications - Livestream 4-20-19 {#encrypt-data-and-communications-livestream-4-20-19}

Video: <https://archive.org/details/stxlug%5F4-20-19>
Meeting Notes: <https://gitlab.com/stxlug/STXLUG-Meetups/-/blob/master/meetups/4-20-19%5FMeetup/notes%5F4-20-19.org>

<iframe src="https://archive.org/embed/stxlug_4-20-19" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>


## Build a Virtualization Server - Livestream 5-18-19 {#build-a-virtualization-server-livestream-5-18-19}

Video: <https://archive.org/details/stxlug%5F5-18-19>
Meeting Notes: <https://gitlab.com/stxlug/STXLUG-Meetups/-/blob/master/meetups/5-18-19%5FMeetup/notes%5F5-18-19.org>

<iframe src="https://archive.org/embed/stxlug_5-18-19" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>


## Kali Linux Introduction - Livestream 7-20-19 {#kali-linux-introduction-livestream-7-20-19}

Video: <https://archive.org/details/kalilinux%5F202203>
Meeting Notes: <https://gitlab.com/stxlug/STXLUG-Meetups/-/blob/master/meetups/7-20-19%5FMeetup/notes%5F7-20-19.org>

<iframe src="https://archive.org/embed/kalilinux_202203" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>


## Build a VPN Server - Livestream 8-17-19 {#build-a-vpn-server-livestream-8-17-19}

Video: <https://archive.org/details/stxlug%5F08-17-19>
Meeting Notes: <https://www.stxlug.com/meetup-8-17-19/>

<iframe src="https://archive.org/embed/stxlug_08-17-19" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>


## Online Security with Tails and Tor Browser - Livestream 10-19-19 {#online-security-with-tails-and-tor-browser-livestream-10-19-19}

Video: <https://archive.org/details/stxlug%5F10-19-19>
Meeting Notes: <https://www.stxlug.com/meetup-10-19-19/>

<iframe src="https://archive.org/embed/stxlug_10-19-19" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>


## CentOS Server How To - Livestream 11-24-19 {#centos-server-how-to-livestream-11-24-19}

Video: <https://archive.org/details/stxlug%5F11-24-19>
Meeting Notes:

<iframe src="https://archive.org/embed/stxlug_11-24-19" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>


## Kali Linux vs. ParrotOS - Livestream 12-21-19 {#kali-linux-vs-dot-parrotos-livestream-12-21-19}

Video: <https://archive.org/details/stxlug%5F12-21-19>
Meeting Notes: <https://gitlab.com/stxlug/STXLUG-Meetups/-/blob/master/meetups/12-21-19%5FMeetup/notes%5F12-21-19.org>

<iframe src="https://archive.org/embed/stxlug_12-21-19" width="640" height="480" frameborder="0" webkitallowfullscreen="true" mozallowfullscreen="true" allowfullscreen></iframe>
